# Data Creation from different sources

In [33]:
import psycopg2
import pandas as pd
from pandas import DataFrame

### Article table

In [ ]:
#con = psycopg2.connect(database="postgres", user="postgres",password="", host="127.0.0.1", port="5432")

#print("Database opened successfully")

In [30]:
cur = con.cursor()
cur.execute("SELECT * From common.articles")
data_article = cur.fetchall()

In [32]:
type(data_article)

list

In [34]:
df_article = DataFrame (data_article,columns=["article_id","article_number","price","year"])
df_article.shape

(1645, 4)

In [35]:
df_article.head()

   article_id  article_number  price  year
0           1             272    8.2  2015
1           2             166    3.9  2015
2           3             154    3.0  2015
3           4             232    9.9  2015
4           5             141    3.4  2015

In [ ]:
df.year.unique()

In [ ]:
df.article_number.nunique()

### customer_meta table

In [45]:
cur = con.cursor()
cur.execute("SELECT * From common.customer_meta")
data_meta = cur.fetchall()

In [47]:
print(data_meta)

[(1, 'hotel', 48.784744, 9.182595, 160, 3)]

### users table

In [48]:
cur = con.cursor()
cur.execute("SELECT * From common.users")
data_users = cur.fetchall()

In [49]:
print(data_users)

[(1, 'Data Engineer'), (2, 'Donal Duck'), (3, 'Luke Skywalker')]

merge with article number

### POS dataset

In [15]:
data_2015=pd.read_csv('POS_data_2015.csv', index_col=0)
                      
data_2015.shape

(430117, 11)

In [17]:
data_2015.head(2)

,kind,invoice_close,invoice_opened,guests,group,invoice,cancellation,ticket,table,time,article_number
0,Pasta,2014-12-31 12:09:00,2014-12-31 11:43:00,1,Speisen,193,0,7103,115/1,2014-12-31 11:43:00,272
1,Bier,2014-12-31 12:09:00,2014-12-31 11:43:00,1,Getränke,193,0,7103,115/1,2014-12-31 11:43:00,166

In [70]:
data_2015.isnull().sum()

kind              0
invoice_close     0
invoice_opened    0
guests            0
group             0
invoice           0
cancellation      0
ticket            0
table             0
time              0
article_number    0
dtype: int64

In [50]:
data_2016=pd.read_csv('POS_data_2016.csv', index_col=0)
data_2016.shape

(419917, 11)

In [57]:
data_2016.head(2)

,kind,invoice_close,invoice_opened,guests,group,invoice,cancellation,ticket,table,time,article_number
0,Pasta,2015-12-31 12:49:00,2015-12-31 11:56:00,5,Speisen,1820,0,7154,113/1,2015-12-31 11:56:00,148
1,Bier,2015-12-31 12:49:00,2015-12-31 11:56:00,5,Getränke,1820,0,7154,113/1,2015-12-31 11:56:00,156

In [69]:
data_2016.isnull().sum()

kind              0
invoice_close     0
invoice_opened    0
guests            0
group             0
invoice           0
cancellation      0
ticket            0
table             0
time              0
article_number    0
dtype: int64

In [51]:
data_2017=pd.read_csv('POS_data_2017.csv', index_col=0)
data_2017.shape

(461712, 11)

In [74]:
data_2017.head(2)

,kind,invoice_close,invoice_opened,guests,group,invoice,cancellation,ticket,table,time,article_number
0,Limonaden,2016-12-31 13:00:00,2016-12-31 11:46:00,10,Getränke,1721,0,9235,313/1,2016-12-31 11:46:00,83
1,Limonaden,2016-12-31 13:00:00,2016-12-31 11:46:00,10,Getränke,1721,0,9235,313/1,2016-12-31 11:46:00,83

In [68]:
data_2017.isnull().sum()

kind              0
invoice_close     0
invoice_opened    0
guests            0
group             0
invoice           0
cancellation      0
ticket            0
table             0
time              0
article_number    0
dtype: int64

In [52]:
data_2018=pd.read_csv('POS_data_2018.csv', index_col=0)
data_2018.shape

(277171, 11)

In [75]:
data_2018.head(2)

,kind,invoice_closed,invoice_opened,guests,group,invoice,cancellation,ticket,table,time,article_number
0,Pasta,2017-12-31 12:21:00,2017-12-31 11:52:00,2,Essen,3790,0,2289,101/1,2017-12-31 11:52:00,206
1,Pasta,2017-12-31 12:21:00,2017-12-31 11:52:00,2,Speisen,3790,0,2289,101/1,2017-12-31 11:52:00,213

In [78]:
data_2018=data_2018.rename(columns={"invoice_closed": "invoice_close"})

In [79]:
data_2018.isnull().sum()

kind              0
invoice_close     0
invoice_opened    0
guests            0
group             0
invoice           0
cancellation      0
ticket            0
table             0
time              0
article_number    0
dtype: int64

##### combing all datasets 2015-2018

In [83]:
data_combine=data_2015.append([data_2016, data_2017,data_2018])
data_combine.shape

(1588917, 11)

In [81]:
data_combine.isnull().sum()

kind              0
invoice_close     0
invoice_opened    0
guests            0
group             0
invoice           0
cancellation      0
ticket            0
table             0
time              0
article_number    0
dtype: int64

In [86]:
df_article.columns

Index(['article_id', 'article_number', 'price', 'year'], dtype='object')

##### chooseing important features only

In [87]:
df_art=df_article[["article_number", "price","year"]]

In [88]:
data_select=data_combine[["article_number","time","guests"]]

#### Merge with article_number

In [91]:
df_merge=pd.merge(data_select, df_art, on='article_number')

In [92]:
df_merge.isnull().sum()

article_number    0
time              0
guests            0
price             0
year              0
dtype: int64

In [93]:
df_merge.head(2)

   article_number                 time  guests  price  year
0             272  2014-12-31 11:43:00       1    8.2  2015
1             272  2014-12-31 11:43:00       1   11.9  2016

In [94]:
df_merge.shape

(6164086, 5)

For our analysis and predictive model, we shall need time , guests and price

In [99]:
df=df_merge[["time","guests","price"]]

In [100]:
df.to_csv('data.csv',index=False)

In [104]:
df_check=pd.read_csv('data.csv')
df_check.shape

(6164086, 3)

In [105]:
df_check.head(2)

                  time  guests  price
0  2014-12-31 11:43:00       1    8.2
1  2014-12-31 11:43:00       1   11.9

In [106]:
df_check.isnull().sum()

time      0
guests    0
price     0
dtype: int64